<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

$schema['discussion']['add'] = array(
    'request_method' => 'POST',
    'verification_scenario' => 'discussion',
    'save_post_data' => array(
        'post_data',
    ),
    'rewrite_controller_status' => array(
        CONTROLLER_STATUS_REDIRECT,
        function () {
            return $_REQUEST['redirect_url'] . '&selected_section=discussion';
        }
    ),
);

return $schema;