<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

$rule = array(
    'base_url' => array('fn_seo_filter_current_url' => array('result_ids', 'full_render', 'filter_id', 'view_all', 'req_range_id', 'features_hash', 'subcats', 'page', 'total', 'hint_q', 'sort_by', 'sort_order', 'items_per_page', 'on_sale_from', 'layout')),
    'search' => true
);

foreach (array('final_sale', 'on_sale', 'bestsellers', 'newest') as $mode) {
    $schema['products'][$mode] = $rule;
}

return $schema;
