<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

defined('BOOTSTRAP') or die('Access denied');

if (isset($schema['cart_content'])) {
    $schema['cart_content']['content'] = [
        'cart' => [
            'type'     => 'function',
            'function' => ['fn_direct_payments_get_mini_cart'],
        ],
    ];

    unset($schema['cart_content']['cache']);
}

$schema['carts_summary'] = [
    'templates' => [
        'addons/direct_payments/blocks/carts_summary.tpl' => [],
    ],
    'wrappers'  => 'blocks/wrappers',
];

return $schema;
