<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

namespace Tygh\Enum;

/**
 * FiscalData1212ObjectNames contains possible values of fiscal data 1212 objects in string format.
 *
 * @package Tygh\Addons\RusTaxes\Enum
 */
class FiscalData1212ObjectNames
{
    const COMMODITY = 'commodity';
    const EXCISE    = 'excise';
    const JOB       = 'job';
    const SERVICE   = 'service';
    const PAYMENT   = 'payment';
}
