<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

defined('BOOTSTRAP') or die('Access denied');

/** @var array $schema */
$schema['commerceml.currencies']['commerceml_prices'] = [
    'href'     => 'commerceml.offers',
    'text'     => __('rus_exim_1c.actions.commerceml_prices'),
    'position' => 200,
];

$schema['commerceml.currencies']['commerceml_taxes'] = [
    'href'     => 'commerceml.taxes',
    'text'     => __('rus_exim_1c.actions.commerceml_taxes'),
    'position' => 300,
];

return $schema;
