<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

/**
 * Describes access to the REST API resources in the guest mode.
 * Caution: the guest mode may be unsafe. Even though there is an application key, that key may be compromised.
 *  That's why the schema must include `readonly` methods only.
 */

return [
    'pages'              => [
        'index' => true,
    ],
    'sra_profile_fields' => [
        'index' => true,
    ],
    'sra_profile'        => [
        'create' => true,
    ],
];