<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

namespace Tygh\Enum\Addons\MobileApp;

/**
 * ReportTypes contains possible values for report type
 *
 * @package Tygh\Enum
 */
class ReportTypes
{
    const REPORT_TYPE_PRODUCT = 'P';
    const REPORT_TYPE_REVIEW = 'R';
    const REPORT_TYPE_DISCUSSION = 'D';
    const REPORT_TYPE_USER = 'U';
    const REPORT_TYPE_VENDOR = 'V';
}
