<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

$schema['companies.apply_for_vendor'] = [
    'from' => [
        'dispatch' => 'companies.apply_for_vendor',
    ],
    'to_admin' => [
        'dispatch' => 'vendor_plans.manage'
    ]
];

$schema['companies.vendor_plans'] = [
    'from' => [
        'dispatch' => 'companies.vendor_plans',
    ],
    'to_admin' => [
        'dispatch'  => 'vendor_plans.manage',
    ]
];

return $schema;