<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

$services = array(
    'lateral_loading' => '0xb83b7589658a3851440a853325d1bf69',
    'top_loading' => '0xabb9c63c596b08f94c3664c930e77778',
    'loadinglift' => '0x92fce2284f000b0241dad7c2e88b1655',
    'manipulator' => '0x88f93a2c37f106d94ff9f7ada8efe886',
    'open_car' => '0x9951e0ff97188f6b4b1b153dfde3cfec',
    'movable' => '0x818e8ff1eda1abc349318a478659af08'
);

return $services;
