<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

$ru = array(
    'а'=>'a', 'А'=>'a',
    'б'=>'b', 'Б'=>'b',
    'в'=>'v', 'В'=>'v',
    'г'=>'g', 'Г'=>'g',
    'д'=>'d', 'Д'=>'d',
    'е'=>'e', 'Е'=>'e',
    'ё'=>'e', 'Ё'=>'e',
    'ж'=>'zh', 'Ж'=>'zh',
    'з'=>'z', 'З'=>'z',
    'и'=>'i', 'И'=>'i',
    'й'=>'y', 'Й'=>'y',
    'к'=>'k', 'К'=>'k',
    'л'=>'l', 'Л'=>'l',
    'м'=>'m', 'М'=>'m',
    'н'=>'n', 'Н'=>'n',
    'о'=>'o', 'О'=>'o',
    'п'=>'p', 'П'=>'p',
    'р'=>'r', 'Р'=>'r',
    'с'=>'s', 'С'=>'s',
    'т'=>'t', 'Т'=>'t',
    'у'=>'u', 'У'=>'u',
    'ф'=>'f', 'Ф'=>'f',
    'х'=>'h', 'Х'=>'h',
    'ц'=>'c', 'Ц'=>'c',
    'ч'=>'ch', 'Ч'=>'ch',
    'ш'=>'sh', 'Ш'=>'sh',
    'щ'=>'sch', 'Щ'=>'sch',
    'ъ'=>'', 'Ъ'=>'',
    'ы'=>'y', 'Ы'=>'y',
    'ь'=>'', 'Ь'=>'',
    'э'=>'e', 'Э'=>'e',
    'ю'=>'yu', 'Ю'=>'yu',
    'я'=>'ya', 'Я'=>'ya',
);

return array_merge($schema, $ru);
