<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

$schema['export_fields']['Pay by points'] = array (
    'db_field' => 'is_pbp',
);

$schema['export_fields']['Override points'] = array (
    'db_field' => 'is_op',
    'process_put' => array('fn_reward_points_override_points', '#key', '#this'),
);

$schema['export_fields']['Override exchange rate'] = array (
    'db_field' => 'is_oper',
);

return $schema;
