<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

use Tygh\Enum\MainMenuTypeVariants;

defined('BOOTSTRAP') or die('Access denied');

return [
    MainMenuTypeVariants::DROPDOWN => [
        'type' => MainMenuTypeVariants::DROPDOWN,
        'description' => __('main_menu_type.dropdown'),
    ],
    MainMenuTypeVariants::COLLAPSE => [
        'type' => MainMenuTypeVariants::COLLAPSE,
        'description' => __('main_menu_type.collapse'),
    ],
];
