<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

defined('BOOTSTRAP') or die('Access denied');

if ($mode === 'details') {
    $order_id = $_REQUEST['order_id'];
    if ($order_id) {
        $order_info = fn_get_order_info($order_id);
        $shipping = isset($order_info['shipping']) ? reset($order_info['shipping']) : null;
        if (isset($shipping['module'])) {
            Tygh::$app['view']->assign('is_order_delivered_by_russian_post', $shipping['module'] === 'russian_post');
        }
    }
}
