<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

$schema = fn_get_schema('documents', 'order');

$schema['return_info'] = array(
    'class' => '\Tygh\Addons\Rma\Documents\PackingSlip\Variables\ReturnInfoVariable',
    'arguments' => array('#context', '#config', '@formatter'),
    'alias' => 'r',
    'attributes' => array(
        'return_id', 'order_id', 'user_id', 'timestamp', 'action', 'status', 'action_name', 'status_name',
        'total_amount', 'comment'
    )
);

return $schema;