<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

$schema['send_categories'] = array(
    '0' => __('addons.rus_russianpost.simple'),
    '1' => __('addons.rus_russianpost.registered'),
    '2' => __('addons.rus_russianpost.declared'),
    '3' => __('addons.rus_russianpost.ordinary'),
    '4' => __('addons.rus_russianpost.declared_cash'),
    '5' => __('addons.rus_russianpost.not_determined'),
    '6' => __('addons.rus_russianpost.declared_binding')
);

return $schema;
