<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

$schema['buy_together'] = [
    'permissions' => ['GET' => 'view_catalog', 'POST' => 'manage_catalog'],
    'modes' => [
        'delete'            => [
            'permissions' => 'manage_catalog'
        ],
        'm_delete'          => [
            'permissions' => 'manage_catalog'
        ],
        'm_update_statuses' => [
            'permissions' => 'manage_catalog'
        ],
    ],
];
$schema['tools']['modes']['update_status']['param_permissions']['table']['buy_together'] = 'manage_catalog';

return $schema;
