<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

defined('BOOTSTRAP') or die('Access denied');

 /** @var array $schema */
$schema['cities'] = [
    'modes' => [
        'delete' => [
            'permissions' => 'manage_cities'
        ],
        'm_delete' => [
            'permissions' => 'manage_cities'
        ]
    ],
    'permissions' => ['GET' => 'view_cities', 'POST' => 'manage_cities'],
];

$schema['tools']['modes']['update_status']['param_permissions']['table']['cities'] = 'manage_cities';

return $schema;
