<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

defined('BOOTSTRAP') or die('Access denied');

use Tygh\Addons\GraphqlApi\Type;

$schema = [
    'name'        => 'Tax',
    'description' => 'Represents a tax',
    'fields'      => [
        'description'        => [
            'type'        => Type::string(),
            'description' => 'Name',
        ],
        'price_includes_tax' => [
            'type'        => Type::boolean(),
            'description' => 'Whether a tax is included into price',
        ],
        'tax_subtotal'       => [
            'type'        => Type::float(),
            'description' => 'Tax value',
        ],
    ],
];

return $schema;
