<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

use Tygh\Addons\ProductVariations\Product\Type\Type;

if (!defined('BOOTSTRAP')) {
    die('Access denied');
}

/**
 * @var array $schema
 */

$schema[Type::PRODUCT_TYPE_VARIATION]['fields'][] = 'unit_name';
$schema[Type::PRODUCT_TYPE_VARIATION]['fields'][] = 'units_in_product';
$schema[Type::PRODUCT_TYPE_VARIATION]['fields'][] = 'show_price_per_x_units';

return $schema;
