<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

$schema['banners'] = array (
    'permissions' => 'manage_banners',
    'modes' => array(
        'update' => array(
            'permissions' => array(
                'GET' => 'view_banners',
                'POST' => 'manage_banners'
            ),
        ),
        'manage' => array(
            'permissions' => 'view_banners',
        ),
        'picker' => array(
            'permissions' => 'view_banners',
        ),
    ),
);
$schema['tools']['modes']['update_status']['param_permissions']['table']['banners'] = 'manage_banners';

return $schema;
