<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

defined('BOOTSTRAP') or die('Access denied');

use Tygh\Addons\RusTaxes\TaxType;

$schema = [
    TaxType::NONE    => 1,
    TaxType::VAT_0   => 2,
    TaxType::VAT_10  => 3,
    TaxType::VAT_20  => 4,
    TaxType::VAT_110 => 5,
    TaxType::VAT_120 => 6,
    TaxType::VAT_5   => 7,
    TaxType::VAT_7   => 8,
    TaxType::VAT_105 => 9,
    TaxType::VAT_107 => 10,
    TaxType::VAT_22  => 11,
    TaxType::VAT_122 => 12,
];

return $schema;
