<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

namespace Tygh\Enum;


/**
 * Class RegistrationFlowTypes
 *
 * @package Tygh\Enum
 */
class RegistrationFlowTypes
{
    const STOREFRONT_VENDOR_PANEL_ACCESS = 'storefront_vendor_panel_access';
    const VENDOR_PANEL_ACCESS = 'vendor_panel_access';
    const NO_ACCESS = 'no_access';
}
