<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

$schema['companies']['apply_for_vendor'] = [
    'request_method' => 'POST',
    'verification_scenario' => 'apply_for_vendor_account',
    'save_post_data' => [
        'user_data',
        'company_data',
    ],
    'rewrite_controller_status' => [
        CONTROLLER_STATUS_REDIRECT,
        'companies.apply_for_vendor',
    ],
];

return $schema;
