<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

defined('BOOTSTRAP') or die('Access denied');

return [
    // Fetch directives
    'child-src' => [],
    'connect-src' => [],
    'default-src' => [],
    'font-src' => [],
    'frame-src' => [],
    'img-src' => [],
    'manifest-src' => [],
    'media-src' => [],
    'object-src' => [],
    'script-src' => [],
    'style-src' => [],
    // Document directives
    'base-uri' => [],
    'plugin-types' => [],
    'sandbox' => [],
    // Navigation directives
    'form-action' => [],
    'frame-ancestors' => [
        'self' => true,
        'allow' => []
    ],
    'navigate-to' => [],
    // Other
    'block-all-mixed-content' => [],
    'upgrade-insecure-requests' => [],
];
