<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

defined('BOOTSTRAP') or die('Access denied');

/** @var array $schema */
$schema['subscribers.manage']['export'] = [
    'href'     => 'exim.export?section=subscribers',
    'text'     => __('actions.export'),
    'position' => 200
];

if (fn_check_permissions('exim', 'import', 'admin', 'POST')) {
    $schema['subscribers.manage']['import'] = [
        'href'     => 'exim.import?section=subscribers',
        'text'     => __('actions.import'),
        'position' => 100
    ];
}

return $schema;
