<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

defined('BOOTSTRAP') or die('Access denied');

$schema = [
    'checkout' => [
        'id' => 'checkout',
        'name' => 'payment_processors.category.checkout',
        'position' => 10,
        'criteria' => [
            'type' => ['B', 'C'],
        ],
    ],
    'gateway' => [
        'id' => 'gateway',
        'name' => 'payment_processors.category.gateway',
        'position' => 20,
        'criteria' => [
            'type' => ['P'],
        ]
    ],
];

return $schema;