<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

use Tygh\Licensing\Features;

defined('BOOTSTRAP') or die('Access denied');

$schema[] = Features::MASTER_PRODUCTS;
$schema[] = Features::VENDOR_RATING;
$schema[] = Features::VENDOR_CATEGORIES_FEE;
$schema[] = Features::VENDOR_PRIVILEGES;
$schema[] = Features::DIRECT_PAYMENTS;
$schema[] = Features::ORDER_FULFILLMENT;

return $schema;
