<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

defined('BOOTSTRAP') or die('Access denied!');

return [
    'html_block' => [
        'name' => true,
    ],
    'smarty_block' => [
        'name' => true,
    ],
    'product_filters' => [
        'name' => true,
    ],
    'products' => [
        'name' => true,
    ],
    'template' => [
        'name' => true,
    ],
    'our_brands' => [
        'name' => true,
    ],
    'checkout' => [
        'name' => true,
    ],
    'safe_smarty_block' => [
        'name' => true,
    ]
];
