<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

defined('BOOTSTRAP') or die('Access denied');

/**
 * @var array $schema
 */
if (defined('PRODUCT_TYPE_VENDOR_PRODUCT_OFFER') && defined('PRODUCT_TYPE_PRODUCT_OFFER_VARIATION')) {
    $schema[PRODUCT_TYPE_VENDOR_PRODUCT_OFFER]['tabs'][] = 'product_bundles';
    $schema[PRODUCT_TYPE_PRODUCT_OFFER_VARIATION]['tabs'][] = 'product_bundles';
}
return $schema;
