<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

function fn_block_get_rss_object_info(array $block, $lang_code = CART_LANGUAGE)
{
    $filling = isset($block['content']['filling']) ? (string) $block['content']['filling'] : '' ;
    $schema_values = isset($block['schema']['content']['filling']['values']) ? (array) $block['schema']['content']['filling']['values'] : [];
    $content = __($schema_values[$filling], [], $lang_code);

    return [
        'content' => $content,
    ];
}