<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

defined('BOOTSTRAP') or die('Access denied');

return [
    'fields' => [
        'product_id'   => ['title' => __('product_id'), 'sort_by' => ''],
        'product'      => ['title' => __('product_name'), 'sort_by' => 'product'],
        'min_qty'      => ['title' => __('min_order_qty'), 'sort_by' => ''],
        'max_qty'      => ['title' => __('max_order_qty'), 'sort_by' => ''],
        'product_code' => ['title' => __('sku'), 'sort_by' => 'code'],
        'amount'       => ['title' => __('quantity'), 'sort_by' => 'amount'],
        'price'        => ['title' => __('price'), 'sort_by' => 'price'],
        'weight'       => ['title' => __('weight'), 'sort_by' => 'weight'],
        'image'        => ['title' => __('image'), 'sort_by' => ''],
    ],
    'types'  => [
        'xlsx' => [
            'extension' => 'xlsx',
        ],
    ],
];
