<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

return [
    'auth' => [
        'allow' => true
    ],
    'image' => [
        'default_allow' => true,
        'allow'         => [
            'upload' => false
        ],
        'areas' => ['A', 'C'],
    ],
    'payment_notification' => [
        'allow' => true
    ],
    'profiles' => [
        'allow' => [
            'password_reminder' => true,
        ],
    ],
    'helpdesk_connector' => [
        'allow' => true
    ],
    'robots' => [
        'allow' => true,
        'areas' => ['C']
    ],
    'bottom_panel' => [
        'allow' => true
    ],
];
