<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

if (!defined('BOOTSTRAP')) { die('Access denied'); }

define('TAGS_MAX_LEVEL', 6);

fn_register_hooks(
    'delete_product_post',
    'clone_product',
    'update_product_post',
    'update_page_post',
    'delete_page',
    'clone_page',
    'get_pages',
    'get_products',
    'seo_is_indexed_page',
    'get_predefined_statuses',
    ['update_tags_post', '', 'product_variations'],
    ['update_tags_post', '', 'master_products']
);
