<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

$schema = array(
    'organization_customer' => array(
        'name' => __('addons.rus_payments.organization_customer'),
    ),
    'address' => array(
        'name' => __('address'),
    ),
    'zip_postal_code' => array(
        'name' => __('zip_postal_code'),
    ),
    'phone' => array(
        'name' => __('phone'),
    ),
    'inn_customer' => array(
        'name' => __('inn_customer'),
    ),
    'bank_details' => array(
        'name' => __('bank_details'),
    )
);

return $schema;
