<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

use Tygh\Addons\RusTaxes\TaxType;

$schema = [
    TaxType::NONE    => 1105,
    TaxType::VAT_0   => 1104,
    TaxType::VAT_10  => 1103,
    TaxType::VAT_5   => 1108,
    TaxType::VAT_7   => 1109,
    TaxType::VAT_18  => 1102,
    TaxType::VAT_20  => 1102,
    TaxType::VAT_22  => 1113,
    TaxType::VAT_105 => 1110,
    TaxType::VAT_107 => 1111,
    TaxType::VAT_110 => 1107,
    TaxType::VAT_118 => 1106,
    TaxType::VAT_120 => 1106,
    TaxType::VAT_122 => 1114,
];

return $schema;
