<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

$schema['call_requests'] = [
    'permissions' => ['GET' => 'view_call_requests', 'POST' => 'manage_call_requests'],
    'modes' => [
        'delete' => [
            'permissions' => 'manage_call_requests'
        ],
        'm_delete' => [
            'permissions' => 'manage_call_requests'
        ],
        'm_update_statuses' => [
            'permissions' => 'manage_call_requests'
        ],
    ],
];

$schema['tools']['modes']['update_status']['param_permissions']['table']['call_requests'] = 'manage_call_requests';

return $schema;
