<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

$schema['data_feeds'] = array (
    'permissions' => array ('GET' => 'view_catalog', 'POST' => 'manage_catalog')
);
$schema['tools']['modes']['update_status']['param_permissions']['table']['data_feeds'] = 'manage_catalog';

$schema['exim']['modes']['export_datafeed']['use_company'] = false;
$schema['exim']['modes']['cron_export']['use_company'] = false;

return $schema;
