<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

$sdek_delivery = array(
    'RU' => 'RUB',
    'US' => 'USD',
    'EU' => 'EUR',
    'KZ' => 'KZT',
    'GB' => 'GBR',
    'CN' => 'CNY',
    'BY' => 'BYN',
    'UA' => 'UAN',
    'AM' => 'AMD',
    'RG' => 'KGS',
);

return $sdek_delivery;
