<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

if (!defined('BOOTSTRAP')) { die('Access denied'); }

// form page type
define('PAGE_TYPE_POLL', 'P');

// ------------------------------------- Types and codes -------------------------------------
//
// Poll types
// A - public (for all)
// P - private
// H - hidden
// D - disabled
//
// Description types
// P - poll
// I - item
// H - header
// F - footer
// R - results
//
// Item types
// Q - question
// M - multi answers question
// T - question with text answer
// A - simple answer
// O - answer with text field
//
// ------------------------------------- Types and codes -------------------------------------
