<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

$schema = array (
    'common' => 'yml2_offer_type_common', // Class not exist, just for common settings of offer
    'simple' => 'yml2_offer_type_simple',
    'vendor' => 'yml2_offer_type_vendor_model',
    'apparel_simple' => 'yml2_offer_type_apparel_simple',
    'apparel' => 'yml2_offer_type_apparel',
    'book' => 'yml2_offer_type_book',
    'video' => 'yml2_offer_type_video',
    'audio' => 'yml2_offer_type_audio'
);

return $schema;