<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

defined('BOOTSTRAP') or die('Access denied');

$schema = [
    'Brand' => [
        'name' => __('seo.brand'),
        'description' => __('seo.feature_code.brand.description'),
    ],
    'ISBN' => [
        'name' => __('seo.isbn'),
        'description' => __('seo.feature_code.isbn.description'),
    ],
    'GTIN' => [
        'name' => __('seo.gtin'),
        'description' => __('seo.feature_code.gtin.description'),
    ],
    'MPN' => [
        'name' => __('seo.mpn'),
        'description' => __('seo.feature_code.mpn.description'),
    ],
];

return $schema;